{
  "app-title": "Nguyễn Văn Trường - Unreal Engine Developer",
  "my-name": "Nguyễn Văn Trường",
  "about-me": "Về tôi",
  "skills": "Kỹ năng",
  "work-experience" : "Kinh nghiệm",
  "hobby": "Sở thích",
  "information" : "Xin chào, tôi là Trường . Năm nay tôi 26 tuổi. Hiện tại tôi đang sử dụng Unreal Engine 4 & 5 để phát triển game.\n • Tôi có hơn 3 năm kinh nghiệm trong phát triển và lập trình game, 5 năm học tập và làm việc với Unreal Engine.\n • Tôi có kinh nghiệm phát triển game với Unreal Engine (C++ & Blueprint) và Unity.\n • Tôi có kinh nghiệm sử dụng một số phần mềm 3D như: Maya, Character Creator 4, iClone8, ...",
  "contact-now": "Liên hệ ngay",
  "platform": "Hệ điều hành",
  "gptwars-description": "là game bắn súng PvE góc nhìn thứ nhất, được thiết kế để người chơi chiến đấu chống lại làn sóng robot trong thế giới hậu tận thế.",
  "elitant-description": "là game bắn súng góc nhìn thứ nhất thuộc thể loại \"Hero Shooter Tactical 5v5\".",
  "mcc-description": ", một thế giới sòng bạc ảo nơi người chơi có thể trải nghiệm cảm giác hồi hộp khi đánh bạc trong một môi trường ảo hoàn toàn chân thực.",
  "osimi-description": "là game bắn súng zombie góc nhìn thứ ba, nơi bạn vào vai những chiến binh cuối cùng sinh tồn chống chọi lại đại dịch zombie trong thế giới hậu tận thế.",
  "graduation-description": "Demon of Hatred là trò chơi trong luận văn tốt nghiệp của tôi. Tôi đã học về \"Gameplay Ability System\" và \"Networking\" trong khi tạo ra trò chơi này.",
  "contact-mail": "Liên hệ qua Mail",
  "contact-linkedin": "Liên hệ qua LinkedIn",
  "contact-fb": "Liên hệ qua Facebook",
  "skills-title": "Kiến thức và kỹ năng",
  "cplus-skill-des": "Tôi phát triển trò chơi bằng Unreal Engine bằng C++, tập trung vào hiệu suất, khả năng tối ưu hóa và lối chơi.",
  "ue-skill-des": "Tôi có hơn 3 năm kinh nghiệm trong lĩnh vực Phát triển trò chơi bằng Unreal Engine (C++ và Blueprint).",
  "meta-human-skill-des": "Tôi sử dụng Metahuman để tạo nhân vật cho quá trình phát triển trò chơi trong Unreal Engine.",
  "rest-skill-des": "Tôi sử dụng REST API để thực hiện chức năng cơ sở dữ liệu. Có thể là lấy/đặt thông tin người chơi, lấy số dư, ...",
  "socketio-skill-des": "Tôi sử dụng SocketIO để tạo một số chức năng cơ bản của mạng xã hội: trò chuyện, bạn bè, thông báo.",
  "postman-skill-des": "Tôi sử dụng Postman để kiểm tra chức năng của API trước khi triển khai vào trò chơi.",
  "git-skill-des": "Tôi sử dụng Github và Perforce làm công cụ kiểm soát nguồn để quản lý dự án và theo dõi những thay đổi trong mã.",
  "cc4-skill-des": "Tôi sử dụng Character Creator 4 để tạo nhân vật cho quá trình phát triển trò chơi trong Unreal Engine.",
  "maya-skill-des": "Tôi sử dụng Maya và Blender để tạo mô hình vật thể 3D cho phát triển trò chơi.",
  "unity-skill-des": "Tôi có kinh nghiệm phát triển trò chơi bằng Unity. Tôi đã tạo một trò chơi casual ở trường đại học bằng Unity.",
  "c#-skill-des": "Tôi sử dụng C# để phát triển trò chơi với Unity và phát triển Back-End cho trò chơi.",
  "android-skill-des": "Tôi đã sử dụng Android Studio (Java) để tạo một ứng dụng học tiếng Anh cho thiết bị di động (tương tự như Duolingo).",
  "lead-role": "Với tư cách là trưởng nhóm UE, trách nhiệm của tôi là:",
  "project-management": "• Quản lý dự án",
  "dev-lyra-starter": "• Phát triển từ Lyra Starter",
  "core-game-mechanics": "• Phát triển tính năng cốt lõi",
  "elitant-core-1": "• Bắn súng chến thuật - Nhiều người chơi",
  "elitant-core-2": "• Kỹ năng nhân vật",
  "elitant-core-3": "• Chế độ chơi: Đặt bom",
  "elitant-gas-1": "• Attribute Set: Máu, Giáp, Tốc độ bắn / thay đạn, v.v...",
  "elitant-gas-2": "• Gameplay Ability: Kỹ năng nhân vật, bắn súng, thay đạn,...",
  "elitant-gas-3": "• Effects/Tag: Buffs/Debuff, gây sát thương, trạng thái nhân vật, v.v",
  "elitant-eos-1": "• Đăng nhập, thông tin người chơi, bạn bè, v.v",
  "elitant-eos-2": "• Phòng chơi, Tìm trận đấu",
  "gptwars-role": "Trò chơi bắn súng:",
  "gptwars-core-1": "• Bắn súng PvE",
  "gptwars-core-2": "• Chế độ: Các đợt sóng kẻ thù",
  "gptwars-core-3": "• Chuyển đổi giữa FPS và TPS",
  "gptwars-gas-1": "Attribute Set: Máu (HP), Giáp",
  "gptwars-gas-2": "Gameplay Ability: Bắn, Thay đạn, Hồi máu, Ném bom, v.v",
  "gptwars-gas-3": "Effects/Tag: Buffs/Debuff, Gây sát thương, v.v",
  "gptwars-ai-1": "• Behavior Tree, Blackboard: Hành động kẻ thù (tuần tra, đuổi theo, tấn công)",
  "game-features": "• Tính năng game",
  "mcc-core-1": "• Cài đặt Pixel Streaming: chơi game qua browser",
  "mcc-core-2": "• Hệ thống tương tác",
  "mcc-core-3": "• Trang phục: thay đổi quần áo, hình đại diện, v.v",
  "mcc-core-4": "• Lái xe",
  "mcc-core-5": "• Web browser trong game (chơi web game)",
  "mcc-api-1": "Làm việc với đội backend để phát triển tính năng trong UE:",
  "mcc-api-2": "• Đăng nhập / Đăng xuất",
  "mcc-api-3": "• Lấy / Lưu thông tin người dùng (kho đồ, NFT, tiền, ...)",
  "mcc-api-4": "• Mạng xã hội",
  "dev-role": "Là một nhà phát triển Unreal Engine, trách nhiệm của tôi là:",
  "release-mobile": "• Phát hành trò chơi trên Google Play và Appstore",
  "osimi-core-1":"• Bắn súng Zombie",
  "osimi-core-2":"• Chế độ: làn sóng kẻ thù",
  "osimi-core-3":"• Hệ thống kho đồ",
  "osimi-core-4":"• Hệ thống Loadout: Nhân vật và Vũ khí",
  "osimi-gas-1":"• Attribute Set: Máu (HP), Stamina, Sát thương, Phòng thủ, v.v",
  "osimi-gas-2":"• Gameplay Ability: Bắn, Thay đạn, Hồi máu, Mua đồ ...",
  "osimi-gas-3":"• Effects/Tag: Hồi máu, Gây sát thương, Trúng độc, v.v ",
  "osimi-api-1": "• Phát triển các tính năng backend (SQL Server): Lấy/Lưu thông tin người chơi (kho đồ, tiền, NFT, ...)",
  "osimi-api-2": "• Gọi API để lấy dữ liệu từ backend trong UE",
  "co-op-steam": "• Co-op nhiều người chơi qua Steam",
  "doh-core-1": "• Game nhập vai hành động (ARPG)",
  "doh-core-2": "• Chế độ chơi: Hầm ngục",
  "doh-core-3": "• Co-op nhiều người chơi qua Steam",
  "doh-gas-1": "• Attribute Set: HP, MP, Sát thương, Phòng thủ",
  "doh-gas-2": "• Gameplay Ability: Tấn công, Kỹ năng, Lướt, Chạy nhanh,...",
  "doh-gas-3": "• Effects/Tag: Hồi máu, Gây sát thương, bùa tăng giảm sát thương, trạng thái choáng, ngã, v.v",
  "localization": "• Bản địa hóa (Đa ngôn ngữ)",
  "deploy-aws": "• Triển khai máy chủ (Dedicated Server) trên Amazon Gamelift (AWS)",
  "graduation-role": "Đồ án tốt nghiệp cá nhân:",
  "dev-role-title": "Unreal Engine Game Developer",
  "freelance-task-1": "• Phát triển gameplay trong Unreal Engine: xây dựng combat system, hệ thống vũ khí, kỹ năng và AI kẻ địch.",
  "freelance-task-2": "• Tích hợp nhân vật 3D, animation, Metahuman; xử lý rig, retarget và tối ưu asset.",
  "freelance-task-3": "• Thiết kế và lập trình UI/HUD, menu, hệ thống nhiệm vụ và lưu/đọc dữ liệu.",
  "freelance-task-4": "• Tối ưu hóa hiệu suất game, quản lý material/LOD và tạo VFX cơ bản.",
  "freelance-task-5": "• Debug, fix bug và viết tài liệu hướng dẫn sử dụng hệ thống đã phát triển.",
  "havoc-core-3": "• Chế độ: Team Death Match, Free For All",
  "havoc-ui-1": "• Menu chính",
  "havoc-ui-2": "• Phòng chờ tìm trận",
  "havoc-ui-3": "• Chọn trang phục cho nhân vật/vũ khí",
  "havoc-ui-4": "• HUD trong game",
  "freelance-description": "Đóng góp vào các dự án của nhiều khách hàng cũng như các nguyên mẫu trò chơi cá nhân.",
  "saiko-core-3": "• Thêm các loại vũ khí trong game: SMG, Sniper",
  "saiko-core-4": "• Chế độ: Hardpoint, Kill Confirmed, Capture The Flag, Free For All",
  "nda-explain": "Hiện đang trong quá trình phát triển. Thông tin về dự án không thể chia sẻ bởi vì NDA.",
  "other-task-1": "• Hệ thống chiến đấu, kho đồ, điều khiển, v.v",
  "other-task-2": "• Tạo animation cho nhân vật"
}